# tap "AdoptOpenJDK/openjdk"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "puma/puma"
tap "moncho/dry"
tap "simplydanny/pass-extensions"
tap "amar1729/formulae"
tap "Matt-Gleich/homebrew-taps"
tap "jesseduffield/lazygit/lazygit"
## Shell
# Encrypted pass-through FUSE file system
brew "encfs"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Monitor a directory for changes and run a shell command. Req by gitwatch
brew "fswatch"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# SSL/TLS cryptography library
brew "openssl"
# Program that can automate interactive applications
brew "expect"
# Monitor data's progress through a pipe
brew "pv"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Classic UNIX line editor
brew "ed"
brew "readline" # ensure gawk gets good readline
# General-purpose data compression with high compression ratio
brew "xz"
# Search tool like grep, but optimized for programmers - http://conqueringthecommandline.com/book/ack_ag
brew "ack"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
brew "ag"
# alternative to `cat`: https://github.com/sharkdp/bat
brew "bat"
# Fast, highly customisable system info script
brew "neofetch"
# Console Matrix
brew "cmatrix"
# Create macOS applications from {Perl,Ruby,sh,Python} scripts
brew "platypus"
# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "dos2unix"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# GNU awk utility
brew "gawk"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# C code prettifier
brew "gnu-indent"
# Install GNU `sed`, overwriting the built-in `sed`
# so we can do "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# upgrade grep so we can get things like inverted match (-v)
brew "grep"
# Search tool like grep and The Silver Searcher
brew "rg"
# Utility for directing compilation
brew "make"
brew "cmake"
# GNU Emacs text editor
brew "emacs"
# Free (GNU) replacement for the Pico text editor
brew "nano"
brew "binutils"
brew "libmikmod"
brew "aalib"
# Improved colored diff
brew "icdiff"
brew "diffutils"
# Color-highlighted diff(1) output
brew "colordiff"
brew "diff-so-fancy"
# Internet file retriever
brew "wget"
# Download with resuming and segmented downloading
brew "aria2"
# Bash script to format a block device to UDF
brew "format-udf"
# https://github.com/jkbrzt/httpie
brew "httpie"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
brew "openconnect"
brew "reattach-to-user-namespace"
# better/more recent version of screen
brew "screen"
brew "asciinema"
brew "tmux"
# The cross-shell prompt for astronauts
brew "starship"
# Distributed, Highly Available, Datacenter-Aware Scheduler
brew "nomad"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Docker Machine Parallels Driver
brew "docker-machine-parallels"
# a Docker manager for the terminal
brew "dry"
# Cross platform, open source .NET development framework
brew "mono"
brew "todo-txt"
brew "tree"
brew "ttyrec"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Official Amazon AWS command-line interface
brew "awscli"
# Mac App Store CLI: https://github.com/mas-cli/mas
brew "mas"

## Languages
# Safe, concurrent, practical language
brew "rust"
# Interpreted, interactive, object-oriented programming language
brew "python3"
# Python version management
brew "pyenv"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Highly capable, feature-rich programming language
brew "perl@5.18"
# Platform built on V8 to build network applications
brew "node"
# Ruby version manager
brew "rbenv"
brew "ruby"

## Servers
# Command-line DNS client
brew "dog"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Drop-in replacement for MySQL
brew "mariadb"
# High-performance, schema-free, document-oriented database
# brew "mongodb"
# Object-relational database system
brew "postgresql"
# Persistent key-value database, with built-in net interface
brew "redis"

# Dependency Manager for PHP
brew "composer"
# Asynchronous event library
brew "libevent"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# need fontconfig to install/build fonts
brew "fontconfig"
# Graph visualization software from AT&T and Bell Labs
brew 'graphviz'
# Terminal based YouTube player and downloader
brew "mps-youtube"
# Media player based on MPlayer and mplayer2
brew "mpv"
# UNIX movie player
brew "mplayer"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# brew "ffmpeg", args: ["with-fdk-aac",  # high-quality audio codec
#                       "with-fontconfig",
#                       "with-freetype",
#                       "with-game-music-emu",  # game music emulation
#                       "with-libass",
#                       "with-libcaca",   # video to text!
#                       "with-librsvg",
#                       "with-libsoxr",
#                       "with-libvidstab",  # video stabilization
#                       "with-libvorbis",
#                       "with-libvpx",
#                       "with-opus",  # high compression audio
#                       "with-rubberband",  # time-stretching and pitch shifting
#                       "with-sdl2",  # ffplay
#                       "with-srt",  # srt subtitle support
#                       "with-tesseract",  # allows OCR
#                       "with-tools",
#                       "with-wavpack",  # lossless audio compression
#                       "with-webp",  # google image format
#                       "with-x265",  # high compression video
#                       "with-zeromq",
#                       "without-qtkit",
#                       "without-xvid"]
# Utility to determine file types
brew "file-formula"
# # Cross-platform application and UI framework
# brew "qt5"
# # Toolkit for creating graphical user interfaces
# brew "gtk+3"

## Git addons
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
brew "bfg"
brew "git-extras"
brew "git-flow"
# Emoji guide for your commit messages
brew "gitmoji"
# Git extension for versioning large files"
brew "git-lfs"
# Ruby client and CLI for GitLab API
brew "gitlab-gem"
# Add GitHub support to git on the command-line
brew "hub"

## Security and penetration testing tool
# Spoof your MAC address in macOS
brew "spoof-mac"
# Rootkit detector
brew "chkrootkit"
brew "pass"
brew "gopass"
# Pass extension that provides an easy flow for updating passwords
brew "pass-update"
# This is a host application for browserpass browser extension providing it access to your password store.
brew "browserpass"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# NCurses Disk Usage
brew "ncdu"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Recursively compute digests on files/directories
brew "md5deep"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Zip password cracker
brew "fcrackzip"
# Port scanning utility for large networks
brew "nmap"
# Network grep
brew "ngrep"
# Display an interface's bandwidth usage
brew "iftop"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Network logon cracker which supports many services
brew "hydra"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Featureful UNIX password cracker
brew "john"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# SSL manipulation tools, \`mitmproxy --host\` runs on 8080
# Man-in-the-middle attacks against SSL encrypted network connections
brew "sslsplit"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# DNS benchmark utility
brew "namebench"
# Graphical network analyzer and capture tool
brew "wireshark"



# Utilities
# â˜¢ï¸ Force quit all applications with one terminal command
brew "nuke"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Configure transparent encryption of files in a Git repo
brew "transcrypt"
# Improved top (interactive process viewer)
brew "htop"
# Alternative to top/htop
brew "glances"
# Version Control Visualization Tool
brew "gource"
# Apply a diff file to an original
brew "gpatch"
# Colorize logfiles and command output
brew "grc"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Popular GNU data compression program
brew "gzip"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", args: ["with-fftw",
                           "with-fontconfig",
                           "with-ghostscript",
                           "with-librsvg",
                           "with-webp"]
# Tool to capture still images from an iSight or other video source
brew "imagesnap" # needed to support gitshots
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive jq
brew "gpanders/tap/ijq"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Terminal file manager
brew "lf"
# File browser
brew "ranger"
# New way to see and navigate directory trees
brew "broot"
# Pager program similar to more
brew "less"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Text-based web browser
brew "lynx"
# Macro processing language
brew "m4"
# Web server access log visualizer with retro style
brew "logstalgia"
# Fast and user friendly build system
brew "meson"
# Text to speech, software speech synthesizer
brew "espeak"
brew "prettyping"
  # Utilities
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Web server scanner
brew "nikto"
# Password generator
brew "pwgen"
# Modular IRC client
brew "irssi"
# IRC to other chat networks gateway
brew "bitlbee"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Synchronize a maildir with an IMAP server
brew "isync"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Modern replacement for ps written by Rust
brew "procs"
# Intuitive find & replace CLI
brew "sd"
# More intuitive version of du in rust
brew "dust"
# Program that allows you to count code, quickly
brew "tokei"
# User interface to the TELNET protocol
brew "telnet"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# Shell command parallelization utility
brew "parallel"
# Install some other useful utilities like `sponge`
# brew "moreutils" # Disable because conflicts with parallel
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Rsync for cloud storage
brew "rclone"
# Unit testing tool
brew "roundup"
# Utility that provides fast incremental file transfer
brew "rsync"
# Diff images from the command-line
brew "spaceman-diff"
# Sparklines for the shell
brew "spark"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line tool to manage your ssh connections
brew "stormssh"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
# brew "sshrc" # temp offline
# Simplified and community-driven man pages
brew "tldr"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Command-line tool for generating regular expressions
brew "grex"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Display word differences between text files
brew "wdiff"
# Download YouTube videos from the command-line
brew "youtube-dl"
# The Dart SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface for WordPress
brew "wp-cli"
# HTTP benchmarking tool
brew "wrk"
# Programatically correct mistyped console commands
brew "thefuck"
# Monitor data's progress through a pipe
brew "pv"
# Instant coding answers via the command-line
brew "howdoi"
# Statistics utility to count lines of code
brew "cloc"
# Identify or delete duplicate files
brew "fdupes"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Remote terminal application
brew "mosh"
brew "npm"
brew "yarn"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
#############################
cask "keyboard-maestro"
cask "fork"
cask "fritzing"
cask "ubersicht"
# cask "motrix" Download manager
cask "kap"
cask "amethyst"
cask "diffmerge"
cask "meld"
cask "unetbootin"
cask "balenaetcher"
cask "brave-browser"
cask "beaker-browser"
cask "appcleaner"
cask "ccleaner"
cask "cryptomator"
cask "disk-inventory-x"
cask "docker"
# Run containers through a simple, yet powerful graphical user interface.
cask "kitematic"
cask "dozer"
cask "dbvisualizer"
cask "firefox"
cask "flux"
cask "integrity"
cask "istumbler"
cask "iterm2"
cask "jdownloader"
cask "keka"
cask "dupeguru"
cask "iina"
cask "qtpass"
cask "keybase"
cask "macs-fan-control"
cask "jeromelebel-mongohub"
cask "mysqlworkbench"
cask "numi"
cask "onyx"
cask "opera"
cask "osxfuse"
cask "parsehub"
cask "webstorm"
cask "phpstorm"
cask "sublime-text"
cask "visual-studio-code"
# Huge set of common tools for making games
cask "godot-mono"
cask "podcastmenu"
cask "postman"
cask "volt"
cask "spectrum"
cask "rocket-chat"
cask "tweet-tray"
cask "discord"
cask "telegram"
cask "robo-3t"
cask "pibakery"
cask "sdformatter"
cask "dbeaver-community"
cask "sequel-pro"
# nosqlbooster-for-mongodb
cask "nosqlbooster-for-mongodb"
cask "winds"
cask "postico"
cask "spectacle"
cask "ngrok"
# cask "charles"
cask "knockknock"
cask "icefloor"
# cask "metasploit"
cask "db-browser-for-sqlite"
cask "srware-iron"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "audio-hijack"
cask "lepton"
# cask "do-not-disturb"
cask "xquartz"
cask "dia"
# cask "bitbar"
# cask "marp"
cask "zettlr"
cask "typora"
cask "vnc-viewer"
# Free instant messaging that connect to AIM, XMPP (Jabber), ICQ, IRC and more
cask "adium"
# Japanese text editor for macOS
cask "mi"
cask "oversight"
# easy to use mac osx image editing application for the rest of us
cask "seashore"
cask "transmit-disk"
cask "karabiner-elements"
# cask "gpg-suite"
cask "adoptopenjdk"
# cask "adoptopenjdk8"
cask "font-fontawesome"
cask "font-awesome-terminal-fonts"
cask "font-hack"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-hack-nerd-font"
# cask "0-ad"
# cask "thii/swift-runtime/swift-runtime"
# mas "Xcode", id: 497799835 # req Mac OS X > 10.14.4
# mas "Pages", id: 409201541
# mas "", id:1451177988
