ack
acpi
alacritty
alsa-plugins
alsa-tools
alsa-utils
amd-ucode
ansible
archcraft-about
archcraft-artworks
archcraft-backgrounds
archcraft-backgrounds-branding
archcraft-bspwm
archcraft-cursor-fluent
archcraft-cursor-future
archcraft-cursor-layan
archcraft-cursor-lyra
archcraft-cursor-material
archcraft-cursor-pear
archcraft-cursor-qogirr
archcraft-cursor-sweet
archcraft-cursor-vimix
archcraft-fonts
archcraft-grub-theme
archcraft-gtk-theme-adapta
archcraft-gtk-theme-arc
archcraft-gtk-theme-blade
archcraft-gtk-theme-cyberpunk
archcraft-gtk-theme-dracula
archcraft-gtk-theme-easy
archcraft-gtk-theme-groot
archcraft-gtk-theme-gruvbox
archcraft-gtk-theme-hack
archcraft-gtk-theme-juno
archcraft-gtk-theme-kripton
archcraft-gtk-theme-manhattan
archcraft-gtk-theme-nordic
archcraft-gtk-theme-rick
archcraft-gtk-theme-slime
archcraft-gtk-theme-spark
archcraft-gtk-theme-sweet
archcraft-gtk-theme-wave
archcraft-gtk-theme-white
archcraft-gtk-theme-windows
archcraft-help
archcraft-hooks
archcraft-icons-arc
archcraft-icons-breeze
archcraft-icons-hack
archcraft-icons-luna
archcraft-icons-luv
archcraft-icons-nordic
archcraft-icons-numix
archcraft-icons-papirus
archcraft-icons-qogir
archcraft-icons-white
archcraft-icons-win11
archcraft-icons-zafiro
archcraft-mirrorlist
archcraft-music
archcraft-omz
archcraft-openbox
archcraft-pixmaps
archcraft-plymouth-theme
archcraft-scripts
archcraft-sddm-theme-default
archcraft-skeleton
archcraft-vim
aria2
arp-scan
asciinema
atril
autoconf
automake
autossh
awesome
b43-fwcutter
baobab
base
bat
betterlockscreen
bind
binutils
binwalk
bison
blueman
bluez
bluez-utils
brltty
broadcom-wl
browserpass
browserpass-chromium
browserpass-firefox
btrfs-progs
byobu
calc
calcurse
chaotic-keyring
chaotic-mirrorlist
cloc
clonezilla
cloud-init
cmake
cmatrix
colordiff
consul
cryptsetup
ctop
cups
dhclient
dhcpcd
dia
dialog
diff-so-fancy
diffutils
discord
dmidecode
dmraid
dnsmasq
docker
dog
dos2unix
dosfstools
downgrade
dunst
e2fsprogs
earlyoom
ed
edk2-shell
efibootmgr
encfs
espeakup
ethtool
exa
exfatprogs
expect
f2fs-tools
fabric
fakeroot
fatresize
fcrackzip
fdupes
ffmpeg
ffmpegthumbnailer
file-roller
firefox
firefox-adblock-plus
flake8
flex
fping
fsarchiver
gcc
gdm
geany
geany-plugins
gedit
gifski
git-lfs
glances
gnome-control-center
gnome-disk-utility
gnome-shell
gnome-shell-extensions
gnome-system-monitor
gnome-todo
gnome-tweaks
gnu-netcat
gopass
gopass-jsonapi
gource
gpart
gparted
gpick
gpm
gptfdisk
graphicsmagick
graphviz
grc
grub
gtk-engine-murrine
gufw
gutenprint
gvfs
gvfs-afc
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-smb
hakuneko-desktop
hashcat
hdparm
highlight
htop
httpie
hub
hyperv
i3lock-color
iftop
inetutils
inotify-tools
ipcalc
iperf3
ipw2100-fw
ipw2200-fw
irssi
isync
iw
iwd
jfsutils
john
jp2a
jq
kitty
ksuperkey
kvantum
lazygit
leftwm
#leftwm-theme-git
less
libfido2
libusb-compat
light
linux
linux-atm
linux-firmware
linux-firmware-marvell
lnav
lsb-release
lsd
lsscsi
lvm2
lxappearance
lynx
maim
make
man-db
man-pages
mdadm
meld
meson
mitmproxy
mkinitcpio
mkinitcpio-firmware
mkinitcpio-nfs-utils
modemmanager
mosh
mpc
mpd
mplayer
mps-youtube
mtools
mtr
nano
nautilus
nbd
ncdu
ncmpcpp
ndisc6
neomutt
nethogs
networkmanager
networkmanager-dmenu-git
networkmanager-openvpn
nfs-utils
nginx
ngrep
nikto
nilfs-utils
nitrogen
nm-connection-editor
nmap
nomad
noto-fonts
noto-fonts-emoji
npm
ntfs-3g
nvme-cli
obmenu-generator
open-iscsi
openconnect
openssh
openvpn
os-prober
p7zip
parallel
partclone
parted
partimage
pass
patch
pavucontrol
pcsclite
perl-linux-desktopfiles
picom-ibhagwan-git
pkgconf
plank
plymouth
polkit
polybar
postgresql
powertop
ppp
pptpclient
prettyping
psutils
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pulseaudio-equalizer-ladspa
pv
pwgen
python-pip
python-pyflakes
python-pywal
python-virtualenv
python2
qt5ct
qtpass
ranger
rclone
realvnc-vnc-server
redis
refind
reflector
reiserfsprogs
ripgrep
rofi
rp-pppoe
rsync
ruby
ruby-rake
rxvt-unicode-terminfo
sauerbraten
screen
sddm
sdparm
sg3_utils
shellcheck
slop
smartmontools
sof-firmware
speedtest-cli
squashfs-tools
sshfs
sslsplit
starship
sublime-text-3
sudo
syncthing
systemd-resolvconf
tcpdump
terminus-font
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tig
timeshift
tldr
tmux
tpm2-tss
translate-shell
trash-cli
ttf-dejavu
tumbler
udftools
udisks2
ueberzug
unrar
unzip
usb_modeswitch
usbmuxd
usbutils
viewnior
vim
virtualbox
vlc
vpnc
wdiff
webstorm
wget
wireguard-tools
wireless-regdb
wireless_tools
wmctrl
wpa_supplicant
wvdial
xarchiver
xclip
xdg-user-dirs
xdg-user-dirs-gtk
xdotool
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xf86-video-fbdev
xf86-video-vesa
xfce-polkit
xfce4-power-manager
xfce4-settings
xfce4-terminal
xfsprogs
xl2tpd
xmlstarlet
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
xsettingsd
yad
yarn
yay
zip
zsh
